#include<stdio.h>








//    //猴子第一天摘下若干个桃子，当即吃了一半，还不瘾，又多吃了一个。第二天早上又将剩下的桃子吃掉一半，又多吃了一个。
//	//以后每天早上都吃了前一天剩下的一半零一个。到第10天早上想再吃时，见只剩下一个桃子了。求第一天共摘了多少
//
//int main(){     
//	int p=1;
//	int d=10;
//	
//	 for(d=10;d>1;d--){
//	 	p=(p+1)*2;
//	 	
//	 }
//	
//	printf("%d",p);
//	
//	return 0;
//}





//int main(){          //一球从100米高度自由落下，每次落地后反跳回原高度的一半；再落下，求它在第10次落地时，共经过多少米？第10次反弹多高？
//	
//	float h=100;
//	int i;
//	float s=100;
//	
//	for(i=1;i<10;i++){
//		s=s+h;	
//		h=h/2; 		
//	}
//	h=h/2;
//	printf("%f\n",s);
//	printf("%f\n",h);
//	
//	
//	return 0;
//}




 
//int main(){      //一个数如果恰好等于它的因子之和，这个数就称为"完数"。例如6=1＋2＋3.编程找出1000以内的所有完数
//	
//   int i;
//   int j;
//   int s;
//  	
//	for(i=1;i<=1000;i++){
//		s=1;
//		for(j=2;j<i;j++){
//			
//			if(i%j==0){			
//				s=s+j;				
//			}
//		}
//		if(i==s){
//			printf("%d\n",i);
//		}		
//	}
//	
//	return 0;
//} 



//int main(){          //求s=a+aa+aaa+aaaa+aa...a的值，其中a是一个数字。例如2+22+222+2222+22222(此时共有5个数相加)，几个数相加有键盘控制。
//	
//	
//	int s=0;
//	int a;
//	int c;
//	int i;
//	
//	scanf("%d %d",&a,&c);
//	
//	s=a;
//	for(i=1;i<c;i++){
//		
//		a=a*10+a;
//		s=s+a;
//	}	 
//	printf("%d",s);	
//	return 0; 
//}





//int main(){          //输入一行字符，分别统计出其中英文字母、空格、数字和其它字符的个数。
//	
//	char c;
//	
//	int a=0;
//	int b=0;
//	int d=0;
//	
//	
//	while((c=getchar())!='\n'){
//		
//		if((c>='a' && c<='z') || (c>='A' && c<='Z')){
//			a++;
//		}
//		else if(c>='0' && c<='9'){
//			b++;
//		}
//		else{
//			d++; 
//		} 
//		
//	}
//	printf("字母%d,数字%d,其他%d",a,b,d); 
//	
//	return 0;
//}







//int main(){             //输入两个正整数m和n，求其最大公约数和最小公倍数。
//	
//	int n;
//	int m;
//	scanf("%d %d",&n,&m);
//	int i;
//		
//	for(i=m;i>=1;i--){
//		if(m%i==0 && n%i==0){
//			printf("最大公约数%d\n",i); 
//			break;
//		} 		
//	}
//	
//	for(i=m;i<=m*n;i++){
//		if(i%m==0 && i%n==0){
//		   printf("最小公倍数%d\n",i); 
//		   break;	
//		}
//	}
//	
//	return 0;
//}




//int main(){      //利用条件运算符的嵌套来完成此题：学习成绩>=90分的同学用A表示，60-89分之间的用B表示，60分以下的用C表示
//	
//	int s;
//	scanf("%d",&s);
//	
//	(s>=90?printf("A"):(s>=60?printf("B"):printf("C")));
//		
//	return 0;
//}
